app/views/conversations/show.html.erb

SELECT "messages".* FROM "messages"  WHERE "messages"."conversation_id" = ?  [["conversation_id", 4]]
---
    <ul>
    <% @message.errors.full_messages.each do |msg| %>