app/controllers/conversations_controller.rb

INSERT INTO "conversations" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-09-24 19:03:00.469826"], ["title", "Fun"], ["updated_at", "2014-09-24 19:03:00.469826"]]
---
	def create
		@conversation = Conversation.new(conversation_params)

		if @conversation.save

SELECT  "conversations".* FROM "conversations"  WHERE "conversations"."id" = ? LIMIT 1  [["id", 2]]
---
	def show
		@conversation = Conversation.find(params[:id])