app/controllers/messages_controller.rb

	def create
		@conversation = Conversation.find(params[:conversation_id])
		@message = Message.new(message_params)
		@message.conversation_id = params[:conversation_id]

		if @message.save
---
SELECT  "conversations".* FROM "conversations"  WHERE "conversations"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "messages" ("comment", "conversation_id", "created_at", "picture", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "hi"], ["conversation_id", 1], ["created_at", "2014-09-24 23:59:04.122225"], ["picture", "zelda1.jpg"], ["updated_at", "2014-09-24 23:59:04.122225"]]