app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'user1' LIMIT 1
---
	def create
		@user = User.find_by(:email => params[:email])