app/controllers/welcome_controller.rb

  def index
  	@user = User.find(session[:user_id]) if session[:user_id]
  	@messages = Message.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "messages".* FROM "messages"   ORDER BY "messages"."id" ASC LIMIT 1